In [4]:
import pandas as pd

In [5]:
import numpy as np

In [6]:
from pandas import Series,DataFrame

In [3]:
obj=pd.Series([1,2,33,4,88,5,66,77])

In [4]:
obj

0     1
1     2
2    33
3     4
4    88
5     5
6    66
7    77
dtype: int64

In [5]:
type(obj)

pandas.core.series.Series

In [6]:
obj.values

array([ 1,  2, 33,  4, 88,  5, 66, 77], dtype=int64)

In [8]:
obj.index

RangeIndex(start=0, stop=8, step=1)

In [11]:
obj.values

array([ 1,  2, 33,  4, 88,  5, 66, 77], dtype=int64)

In [14]:
obj2=pd.Series([4,7,8,9],index=['a','b','c','d'])

In [15]:
obj2

a    4
b    7
c    8
d    9
dtype: int64

In [18]:
obj2[['a','b','c']]

a    4
b    7
c    8
dtype: int64

In [19]:
obj2['d']=98

In [20]:
obj2

a     4
b     7
c     8
d    98
dtype: int64

In [25]:
obj2>0

a    True
b    True
c    True
d    True
dtype: bool

In [27]:
obj2[obj2>4]

b     7
c     8
d    98
dtype: int64

In [28]:
obj2*2

a      8
b     14
c     16
d    196
dtype: int64

In [31]:
obj2**2

a      16
b      49
c      64
d    9604
dtype: int64

In [36]:
np.exp(obj2)

a    5.459815e+01
b    1.096633e+03
c    2.980958e+03
d    3.637971e+42
dtype: float64

In [37]:
'd' in obj2

True

In [38]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
sdata1=

In [39]:
obj3 = pd.Series(sdata)

In [40]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [41]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)

In [42]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [43]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [44]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [45]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [46]:
frame=pd.DataFrame(data)c

In [47]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [48]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [50]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [52]:
pd.DataFrame(data,columns=["year","pop"])

   year  pop
0  2000  1.5
1  2001  1.7
2  2002  3.6
3  2001  2.4
4  2002  2.9
5  2003  3.2

In [66]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2] }

In [69]:
frame1=pd.DataFrame(data,index= ["one","two","three","four","five","six"])

In [70]:
frame1

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9
six    Nevada  2003  3.2

In [72]:
frame1.loc[:'two']

    state  year  pop
one  Ohio  2000  1.5
two  Ohio  2001  1.7

In [73]:
frame.iloc[0:3]

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [74]:
val=pd.Series([-1.2,-1.5,2.4,5.6],index= ["two","three","four","one"])

In [75]:
frame1['Debt']=val

In [76]:
frame1

        state  year  pop  Debt
one      Ohio  2000  1.5   5.6
two      Ohio  2001  1.7  -1.2
three    Ohio  2002  3.6  -1.5
four   Nevada  2001  2.4   2.4
five   Nevada  2002  2.9   NaN
six    Nevada  2003  3.2   NaN

In [78]:
frame1['Debt']=range(1,7)

In [79]:
frame1

        state  year  pop  Debt
one      Ohio  2000  1.5     1
two      Ohio  2001  1.7     2
three    Ohio  2002  3.6     3
four   Nevada  2001  2.4     4
five   Nevada  2002  2.9     5
six    Nevada  2003  3.2     6

In [82]:
frame1['Debt'][['six','one']]=13,14

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [2]:
info = {'Name': ['Ammar', 'Shamikh', 'Hamza', 'Minza', 'Nabiha', 'Haseeb'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'GP': [3.3,3.5,3.6,3.2,3,3.1] }

In [85]:
frame1['eastern']=["Pass" if i=="Ohio" else "Fail" for i in frame1.state ]

In [86]:
frame2

        state  year  pop  Debt eastern
one      Ohio  2000  1.5    14    Pass
two      Ohio  2001  1.7     2    Pass
three    Ohio  2002  3.6     3    Pass
four   Nevada  2001  2.4     4    Fail
five   Nevada  2002  2.9     5    Fail
six    Nevada  2003  3.2    13    Fail

In [8]:
frame3=pd.DataFrame(info,index= ["one","two","three","four","five","six"])

In [89]:
frame3

          Name  year   GP
one      Ammar  2000  3.3
two    Shamikh  2001  3.5
three    Hamza  2002  3.6
four     Minza  2001  3.2
five    Nabiha  2002  3.0
six     Haseeb  2003  3.1

In [9]:
frame3['Banda']=["Cheeti" if i>3.1 else "Nalla" for i in frame3.GP ]

In [10]:
frame3

          Name  year   GP   Banda
one      Ammar  2000  3.3  Cheeti
two    Shamikh  2001  3.5  Cheeti
three    Hamza  2002  3.6  Cheeti
four     Minza  2001  3.2  Cheeti
five    Nabiha  2002  3.0   Nalla
six     Haseeb  2003  3.1   Nalla